Revit 2027 API
VertexBuffer.GetMappedHandle Method
 Gets a handle to the buffer's memory that has been mapped. Writing data to the buffer using the handle is an alternative to using stream objects.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IntPtr GetMappedHandle()
Public Function GetMappedHandle As IntPtr
public:
IntPtr GetMappedHandle()
member GetMappedHandle : unit -> IntPtr
Return Value
IntPtr
 The handle to the mapped memory or nullptr when the buffer is not mapped.
See Also
Reference
VertexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace